{
	"class_name": "Sequential",
	"config": [{
		"class_name": "Conv2D",
		"config": {
			"name": "Bl01_Conv",
			"trainable": false,
			"batch_input_shape": [null,
			98,
			98,
			1],
			"dtype": "float32",
			"filters": 64,
			"kernel_size": [5,
			5],
			"strides": [1,
			1],
			"padding": "same",
			"data_format": "channels_last",
			"dilation_rate": [1,
			1],
			"activation": "linear",
			"use_bias": true,
			"kernel_initializer": {
				"class_name": "VarianceScaling",
				"config": {
					"scale": 1.0,
					"mode": "fan_avg",
					"distribution": "uniform",
					"seed": null
				}
			},
			"bias_initializer": {
				"class_name": "Zeros",
				"config": {
					
				}
			},
			"kernel_regularizer": null,
			"bias_regularizer": null,
			"activity_regularizer": null,
			"kernel_constraint": null,
			"bias_constraint": null
		}
	},
	{
		"class_name": "PReLU",
		"config": {
			"name": "Bl01_PReLU",
			"trainable": false,
			"alpha_initializer": {
				"class_name": "Zeros",
				"config": {
					
				}
			},
			"alpha_regularizer": null,
			"alpha_constraint": null,
			"shared_axes": null
		}
	},
	{
		"class_name": "AveragePooling2D",
		"config": {
			"name": "Bl01_Pooling",
			"trainable": false,
			"pool_size": [2,
			2],
			"padding": "valid",
			"strides": [2,
			2],
			"data_format": "channels_last"
		}
	},
	{
		"class_name": "Conv2D",
		"config": {
			"name": "Bl02_Conv",
			"trainable": false,
			"filters": 128,
			"kernel_size": [5,
			5],
			"strides": [1,
			1],
			"padding": "valid",
			"data_format": "channels_last",
			"dilation_rate": [1,
			1],
			"activation": "linear",
			"use_bias": true,
			"kernel_initializer": {
				"class_name": "VarianceScaling",
				"config": {
					"scale": 1.0,
					"mode": "fan_avg",
					"distribution": "uniform",
					"seed": null
				}
			},
			"bias_initializer": {
				"class_name": "Zeros",
				"config": {
					
				}
			},
			"kernel_regularizer": null,
			"bias_regularizer": null,
			"activity_regularizer": null,
			"kernel_constraint": null,
			"bias_constraint": null
		}
	},
	{
		"class_name": "PReLU",
		"config": {
			"name": "Bl02_PRelu",
			"trainable": false,
			"alpha_initializer": {
				"class_name": "Zeros",
				"config": {
					
				}
			},
			"alpha_regularizer": null,
			"alpha_constraint": null,
			"shared_axes": null
		}
	},
	{
		"class_name": "AveragePooling2D",
		"config": {
			"name": "Bl02_Pooling",
			"trainable": false,
			"pool_size": [2,
			2],
			"padding": "valid",
			"strides": [2,
			2],
			"data_format": "channels_last"
		}
	},
	{
		"class_name": "Conv2D",
		"config": {
			"name": "Bl03_Conv",
			"trainable": false,
			"filters": 256,
			"kernel_size": [5,
			5],
			"strides": [1,
			1],
			"padding": "valid",
			"data_format": "channels_last",
			"dilation_rate": [1,
			1],
			"activation": "linear",
			"use_bias": true,
			"kernel_initializer": {
				"class_name": "VarianceScaling",
				"config": {
					"scale": 1.0,
					"mode": "fan_avg",
					"distribution": "uniform",
					"seed": null
				}
			},
			"bias_initializer": {
				"class_name": "Zeros",
				"config": {
					
				}
			},
			"kernel_regularizer": null,
			"bias_regularizer": null,
			"activity_regularizer": null,
			"kernel_constraint": null,
			"bias_constraint": null
		}
	},
	{
		"class_name": "PReLU",
		"config": {
			"name": "Bl03_PRelu",
			"trainable": false,
			"alpha_initializer": {
				"class_name": "Zeros",
				"config": {
					
				}
			},
			"alpha_regularizer": null,
			"alpha_constraint": null,
			"shared_axes": null
		}
	},
	{
		"class_name": "AveragePooling2D",
		"config": {
			"name": "Bl03_Pooling",
			"trainable": false,
			"pool_size": [2,
			2],
			"padding": "valid",
			"strides": [2,
			2],
			"data_format": "channels_last"
		}
	},
	{
		"class_name": "Dropout",
		"config": {
			"name": "Dropout1",
			"trainable": false,
			"rate": 0.25
		}
	},
	{
		"class_name": "Flatten",
		"config": {
			"name": "Ligacao",
			"trainable": false
		}
	},
	{
		"class_name": "Dense",
		"config": {
			"name": "Classi_Densa1",
			"trainable": false,
			"units": 512,
			"activation": "linear",
			"use_bias": true,
			"kernel_initializer": {
				"class_name": "VarianceScaling",
				"config": {
					"scale": 1.0,
					"mode": "fan_avg",
					"distribution": "uniform",
					"seed": null
				}
			},
			"bias_initializer": {
				"class_name": "Zeros",
				"config": {
					
				}
			},
			"kernel_regularizer": null,
			"bias_regularizer": null,
			"activity_regularizer": null,
			"kernel_constraint": null,
			"bias_constraint": null
		}
	},
	{
		"class_name": "PReLU",
		"config": {
			"name": "Classi_PRelu",
			"trainable": false,
			"alpha_initializer": {
				"class_name": "Zeros",
				"config": {
					
				}
			},
			"alpha_regularizer": null,
			"alpha_constraint": null,
			"shared_axes": null
		}
	},
	{
		"class_name": "Dropout",
		"config": {
			"name": "Dropout2",
			"trainable": false,
			"rate": 0.5
		}
	},
	{
		"class_name": "Dense",
		"config": {
			"name": "Classi_Densa2",
			"trainable": false,
			"units": 7,
			"activation": "softmax",
			"use_bias": true,
			"kernel_initializer": {
				"class_name": "VarianceScaling",
				"config": {
					"scale": 1.0,
					"mode": "fan_avg",
					"distribution": "uniform",
					"seed": null
				}
			},
			"bias_initializer": {
				"class_name": "Zeros",
				"config": {
					
				}
			},
			"kernel_regularizer": null,
			"bias_regularizer": null,
			"activity_regularizer": null,
			"kernel_constraint": null,
			"bias_constraint": null
		}
	}],
	"keras_version": "2.0.7",
	"backend": "tensorflow"
}